[MissionTimers]
EmergencyDefenseTitle="Hold Position"
EmergencyDefenseSubtitle="Turns until extraction arrives"

[EmergencyDefense_Reapers X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Rescue the Resistance Operative"
ObjectiveTextPools[1]="Do not allow the Resistance Operative to die"
ObjectiveTextPools[2]="Hold position until EVAC is available"
ObjectiveTextPools[3]="Extract the Resistance Operative"
ObjectiveTextPools[4]="Extract all XCOM operatives"

[EmergencyDefense_Reapers X2MissionTemplate]
DisplayName="Recover Reaper-Affiliated Operative"
Briefing="Recover Reaper-Affiliated Operative"
PostMissionType="Recover Reaper-Affiliated Operative"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Recover and Extract Resistance Operative"
ObjectiveTextPools[1]="Extract all XCOM Operatives"
ObjectiveTextPools[2]="Reaper Agent is on site to assist"
PreMissionNarratives[0]="X2NarrativeMoments.TACTICAL.Extract.Central_Council_Missions_Extract_VIP_01"
PreMissionNarratives[1]="X2NarrativeMoments.TACTICAL.Extract.Central_Council_Missions_Extract_VIP_02"
PreMissionNarratives[2]="X2NarrativeMoments.TACTICAL.Extract.Central_Council_Missions_Extract_VIP_03"
PreMissionNarratives[3]="X2NarrativeMoments.TACTICAL.Extract.Central_Council_Missions_Extract_VIP_04"
PreMissionNarratives[4]="X2NarrativeMoments.TACTICAL.Extract.Central_Council_Missions_Extract_VIP_05"


;templar
[EmergencyDefense_Templars X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Rescue the Resistance Operative"
ObjectiveTextPools[1]="Do not allow the Resistance Operative to die"
ObjectiveTextPools[2]="Hold position until EVAC is available"
ObjectiveTextPools[3]="Extract the Resistance Operative"
ObjectiveTextPools[4]="Extract all XCOM operatives"

[EmergencyDefense_Templars X2MissionTemplate]
DisplayName="Recover Templar-Affiliated Operative"
Briefing="Recover Templar-Affiliated Operative"
PostMissionType="Recover Templar-Affiliated Operative"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Recover and Extract Resistance Operative"
ObjectiveTextPools[1]="Extract all XCOM Operatives"
ObjectiveTextPools[2]="Templar Disciple is on site to assist"
PreMissionNarratives[0]="X2NarrativeMoments.TACTICAL.Extract.Central_Council_Missions_Extract_VIP_01"
PreMissionNarratives[1]="X2NarrativeMoments.TACTICAL.Extract.Central_Council_Missions_Extract_VIP_02"
PreMissionNarratives[2]="X2NarrativeMoments.TACTICAL.Extract.Central_Council_Missions_Extract_VIP_03"
PreMissionNarratives[3]="X2NarrativeMoments.TACTICAL.Extract.Central_Council_Missions_Extract_VIP_04"
PreMissionNarratives[4]="X2NarrativeMoments.TACTICAL.Extract.Central_Council_Missions_Extract_VIP_05"

;
;skirmisher
[EmergencyDefense_Skirmishers X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Rescue the Resistance Operative"
ObjectiveTextPools[1]="Do not allow the Resistance Operative to die"
ObjectiveTextPools[2]="Hold position until EVAC is available"
ObjectiveTextPools[3]="Extract the Resistance Operative"
ObjectiveTextPools[4]="Extract all XCOM operatives"

[EmergencyDefense_Skirmishers X2MissionTemplate]
DisplayName="Recover Skirmisher-Affiliated Operative"
Briefing="Recover Skirmisher-Affiliated Operative"
PostMissionType="Recover Skirmisher-Affiliated Operative"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Recover and Extract Resistance Operative"
ObjectiveTextPools[1]="Extract all XCOM Operatives"
ObjectiveTextPools[2]="Skirmisher Warrior is on site to assist"
PreMissionNarratives[0]="X2NarrativeMoments.TACTICAL.Extract.Central_Council_Missions_Extract_VIP_01"
PreMissionNarratives[1]="X2NarrativeMoments.TACTICAL.Extract.Central_Council_Missions_Extract_VIP_02"
PreMissionNarratives[2]="X2NarrativeMoments.TACTICAL.Extract.Central_Council_Missions_Extract_VIP_03"
PreMissionNarratives[3]="X2NarrativeMoments.TACTICAL.Extract.Central_Council_Missions_Extract_VIP_04"
PreMissionNarratives[4]="X2NarrativeMoments.TACTICAL.Extract.Central_Council_Missions_Extract_VIP_05"

;start of avatar project vip mission

[RM_Sabotage_Neutralize X2MissionTemplate]
DisplayName="Neutralize Avatar Project VIP"
Briefing="Neutralize Avatar Project VIP"
PostMissionType="Neutralize Targets"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Capture or kill enemy VIP"
ObjectiveTextPools[1]="Capturing VIP will net bonus intel, but is not required"
PreMissionNarratives[0]="X2NarrativeMoments.TACTICAL.Neutralize.Central_Council_Missions_Neutralize_Target_01"
PreMissionNarratives[1]="X2NarrativeMoments.TACTICAL.Neutralize.Central_Council_Missions_Neutralize_Target_02"
PreMissionNarratives[2]="X2NarrativeMoments.TACTICAL.Neutralize.Central_Council_Missions_Neutralize_Target_03"
PreMissionNarratives[3]="X2NarrativeMoments.TACTICAL.Neutralize.Central_Council_Missions_Neutralize_Target_04"
PreMissionNarratives[4]="X2NarrativeMoments.TACTICAL.Neutralize.Central_Council_Missions_Neutralize_Target_05"

[RM_Sabotage_Neutralize X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Turns until Skyranger must retreat"
ObjectiveTextPools[1]="Capture or kill enemy VIP"
ObjectiveTextPools[2]="Extract the VIP at designated location"
ObjectiveTextPools[3]="Extract all XCOM soldiers"
ObjectiveTextPools[4]="Hostile VIP"
ObjectiveTextPools[5]="To capture the VIP, move a soldier to close range and use the \"Subdue\" ability. Then carry the unconscious VIP to the evac zone."

;start of terror escape
[TerrorEscape X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Rescue at least one of the haven personnel"
ObjectiveTextPools[1]="Extract all XCOM operatives"

[TerrorEscape X2MissionTemplate]
DisplayName="Rescue Haven Survivors"
Briefing="Haven Rescue"
PostMissionType="Haven Rescue"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Rescue and escort haven survivors to evac point"
ObjectiveTextPools[1]="Survivors are carrying ADVENT items, evacuate them to acquire the items"
ObjectiveTextPools[2]="ADVENT will go on full alert once Firebrand starts picking up people"
PreMissionNarratives[0]="X2NarrativeMoments.TACTICAL.Unique.Central_Unique_Missions_Terror_Attack"
PreMissionNarratives[1]="X2NarrativeMoments.TACTICAL.Unique.T_Unique_Missions_Terror_Attack_Central_02"
PreMissionNarratives[2]="X2NarrativeMoments.TACTICAL.Unique.T_Unique_Missions_Terror_Attack_Central_03"
PreMissionNarratives[3]="X2NarrativeMoments.TACTICAL.Unique.T_Unique_Missions_Terror_Attack_Central_04"
PreMissionNarratives[4]="X2NarrativeMoments.TACTICAL.Unique.T_Unique_Missions_Terror_Attack_Central_05"
PreMissionNarratives[5]="X2NarrativeMoments.TACTICAL.Terror.T_Terror_Narrative_Wrappers_01"
PreMissionNarratives[6]="X2NarrativeMoments.TACTICAL.Terror.T_Terror_Narrative_Wrappers_02"
PreMissionNarratives[7]="X2NarrativeMoments.TACTICAL.Terror.T_Terror_Narrative_Wrappers_03"
PreMissionNarratives[8]="X2NarrativeMoments.TACTICAL.Terror.T_Terror_Narrative_Wrappers_04"
PreMissionNarratives[9]="X2NarrativeMoments.TACTICAL.Terror.T_Terror_Narrative_Wrappers_05"



[RM_OperativeEscort X2MissionTemplate]
DisplayName="Escort Resistance Operative to Workstation"
Briefing="Escort Resistance Operative to Workstation"
PostMissionType="Escort Resistance Operative"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Neutralize all enemy targets"
ObjectiveTextPools[1]="Recover <XGParam:StrValue0/!QuestItemName/> from network. Res. operative can hack into ADVENT's network more fully."
ObjectiveTextPools[2]="Resistance operative is carrying additional intel: their survival should be considered a priority"
PreMissionNarratives[0]="X2NarrativeMoments.TACTICAL.Hack.Central_Guerilla_Ops_Hack_Workstation_Advent_Building_01"
PreMissionNarratives[1]="X2NarrativeMoments.TACTICAL.Hack.Central_Guerilla_Ops_Hack_Workstation_Advent_Building_02"
PreMissionNarratives[2]="X2NarrativeMoments.TACTICAL.Hack.Central_Guerilla_Ops_Hack_Workstation_Advent_Building_03"
PreMissionNarratives[3]="X2NarrativeMoments.TACTICAL.Hack.Central_Guerilla_Ops_Hack_Workstation_Advent_Building_04"
PreMissionNarratives[4]="X2NarrativeMoments.TACTICAL.Hack.Central_Guerilla_Ops_Hack_Workstation_Advent_Building_05"

[RM_OperativeEscort X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Neutralize all enemy targets"
ObjectiveTextPools[1]="Download %QUESTITEM% from exposed access point"
ObjectiveTextPools[2]="Extract all XCOM soldiers"
ObjectiveTextPools[3]="Optional: Extract operative to secure additional intel"
ObjectiveTextPools[4]="Optional: Use resistance operative to hack the access point to stun all enemies"
ObjectiveTextPools[5]="Survive enemy reinforcements"

;non mission stuff
[ReaperAgent X2CharacterTemplate]
strCharacterName="Reaper Agent"
strCharacterBackgroundMale[0]="Word among the Reapers is that <XGParam:StrValue1/!FirstName/> was already an adept hunter living in the outlands of <XGParam:StrValue0/!CountryName/> before joining the group. He quickly came to be seen as a mentor to the less experienced fighters among their people."
strCharacterBackgroundMale[1]="<XGParam:StrValue1/!FirstName/> is said to be something of a master among the Reapers when it comes to the preparation of exotic meats, namely those butchered from among the alien armies. \"Bash 'em, drain 'em, stick 'em on a spit.\""
strCharacterBackgroundMale[2]="Initially rejected by Volk for showing mercy to a wounded ADVENT soldier during conflicts in <XGParam:StrValue0/!CountryName/>, <XGParam:StrValue1/!FirstName/> faced ongoing scrutiny among the Reapers as he tried to shake off his forgiving reputation."
strCharacterBackgroundMale[3]="<XGParam:StrValue1/!FirstName/> is notably reclusive even for a Reaper. He's allegedly from somewhere in <XGParam:StrValue0/!CountryName/>, but Volk isn't the type to press his people for unnecessary details."
strCharacterBackgroundMale[4]="<XGParam:StrValue1/!FirstName/> is a well-known trophy collector among the Reapers, often scavenging bits and pieces for his collection that would otherwise have been thrown into the stew pot."
strCharacterBackgroundFemale[0]="Word among the Reapers is that <XGParam:StrValue1/!FirstName/> was already an adept hunter living in the outlands of <XGParam:StrValue0/!CountryName/> before joining the group. She quickly came to be seen as a mentor to the less experienced fighters among their people."
strCharacterBackgroundFemale[1]="<XGParam:StrValue1/!FirstName/> is said to be something of a master among the Reapers when it comes to the preparation of exotic meats, namely those butchered from among the alien armies. \"Bash 'em, drain 'em, stick 'em on a spit.\""
strCharacterBackgroundFemale[2]="Initially rejected by Volk for showing mercy to a wounded ADVENT soldier during conflicts in <XGParam:StrValue0/!CountryName/>, <XGParam:StrValue1/!FirstName/> faced ongoing scrutiny among the Reapers as she tried to shake off her forgiving reputation."
strCharacterBackgroundFemale[3]="<XGParam:StrValue1/!FirstName/> is notably reclusive even for a Reaper. She's allegedly from somewhere in <XGParam:StrValue0/!CountryName/>, but Volk isn't the type to press his people for unnecessary details." 
strCharacterBackgroundFemale[4]="<XGParam:StrValue1/!FirstName/> is a well-known trophy collector among the Reapers, often scavenging bits and pieces for her collection that would have otherwise been thrown into the stew pot." 

[ReaperAgent_M2 X2CharacterTemplate]
strCharacterName="Reaper Operative"
strCharacterBackgroundMale[0]="Word among the Reapers is that <XGParam:StrValue1/!FirstName/> was already an adept hunter living in the outlands of <XGParam:StrValue0/!CountryName/> before joining the group. He quickly came to be seen as a mentor to the less experienced fighters among their people."
strCharacterBackgroundMale[1]="<XGParam:StrValue1/!FirstName/> is said to be something of a master among the Reapers when it comes to the preparation of exotic meats, namely those butchered from among the alien armies. \"Bash 'em, drain 'em, stick 'em on a spit.\""
strCharacterBackgroundMale[2]="Initially rejected by Volk for showing mercy to a wounded ADVENT soldier during conflicts in <XGParam:StrValue0/!CountryName/>, <XGParam:StrValue1/!FirstName/> faced ongoing scrutiny among the Reapers as he tried to shake off his forgiving reputation."
strCharacterBackgroundMale[3]="<XGParam:StrValue1/!FirstName/> is notably reclusive even for a Reaper. He's allegedly from somewhere in <XGParam:StrValue0/!CountryName/>, but Volk isn't the type to press his people for unnecessary details."
strCharacterBackgroundMale[4]="<XGParam:StrValue1/!FirstName/> is a well-known trophy collector among the Reapers, often scavenging bits and pieces for his collection that would otherwise have been thrown into the stew pot."
strCharacterBackgroundFemale[0]="Word among the Reapers is that <XGParam:StrValue1/!FirstName/> was already an adept hunter living in the outlands of <XGParam:StrValue0/!CountryName/> before joining the group. She quickly came to be seen as a mentor to the less experienced fighters among their people."
strCharacterBackgroundFemale[1]="<XGParam:StrValue1/!FirstName/> is said to be something of a master among the Reapers when it comes to the preparation of exotic meats, namely those butchered from among the alien armies. \"Bash 'em, drain 'em, stick 'em on a spit.\""
strCharacterBackgroundFemale[2]="Initially rejected by Volk for showing mercy to a wounded ADVENT soldier during conflicts in <XGParam:StrValue0/!CountryName/>, <XGParam:StrValue1/!FirstName/> faced ongoing scrutiny among the Reapers as she tried to shake off her forgiving reputation."
strCharacterBackgroundFemale[3]="<XGParam:StrValue1/!FirstName/> is notably reclusive even for a Reaper. She's allegedly from somewhere in <XGParam:StrValue0/!CountryName/>, but Volk isn't the type to press his people for unnecessary details." 
strCharacterBackgroundFemale[4]="<XGParam:StrValue1/!FirstName/> is a well-known trophy collector among the Reapers, often scavenging bits and pieces for her collection that would have otherwise been thrown into the stew pot." 


[ReaperAgent_M3 X2CharacterTemplate]
strCharacterName="Reaper Elite"
strCharacterBackgroundMale[0]="Word among the Reapers is that <XGParam:StrValue1/!FirstName/> was already an adept hunter living in the outlands of <XGParam:StrValue0/!CountryName/> before joining the group. He quickly came to be seen as a mentor to the less experienced fighters among their people."
strCharacterBackgroundMale[1]="<XGParam:StrValue1/!FirstName/> is said to be something of a master among the Reapers when it comes to the preparation of exotic meats, namely those butchered from among the alien armies. \"Bash 'em, drain 'em, stick 'em on a spit.\""
strCharacterBackgroundMale[2]="Initially rejected by Volk for showing mercy to a wounded ADVENT soldier during conflicts in <XGParam:StrValue0/!CountryName/>, <XGParam:StrValue1/!FirstName/> faced ongoing scrutiny among the Reapers as he tried to shake off his forgiving reputation."
strCharacterBackgroundMale[3]="<XGParam:StrValue1/!FirstName/> is notably reclusive even for a Reaper. He's allegedly from somewhere in <XGParam:StrValue0/!CountryName/>, but Volk isn't the type to press his people for unnecessary details."
strCharacterBackgroundMale[4]="<XGParam:StrValue1/!FirstName/> is a well-known trophy collector among the Reapers, often scavenging bits and pieces for his collection that would otherwise have been thrown into the stew pot."
strCharacterBackgroundFemale[0]="Word among the Reapers is that <XGParam:StrValue1/!FirstName/> was already an adept hunter living in the outlands of <XGParam:StrValue0/!CountryName/> before joining the group. She quickly came to be seen as a mentor to the less experienced fighters among their people."
strCharacterBackgroundFemale[1]="<XGParam:StrValue1/!FirstName/> is said to be something of a master among the Reapers when it comes to the preparation of exotic meats, namely those butchered from among the alien armies. \"Bash 'em, drain 'em, stick 'em on a spit.\""
strCharacterBackgroundFemale[2]="Initially rejected by Volk for showing mercy to a wounded ADVENT soldier during conflicts in <XGParam:StrValue0/!CountryName/>, <XGParam:StrValue1/!FirstName/> faced ongoing scrutiny among the Reapers as she tried to shake off her forgiving reputation."
strCharacterBackgroundFemale[3]="<XGParam:StrValue1/!FirstName/> is notably reclusive even for a Reaper. She's allegedly from somewhere in <XGParam:StrValue0/!CountryName/>, but Volk isn't the type to press his people for unnecessary details." 
strCharacterBackgroundFemale[4]="<XGParam:StrValue1/!FirstName/> is a well-known trophy collector among the Reapers, often scavenging bits and pieces for her collection that would have otherwise been thrown into the stew pot." 



[SkirmisherWarrior X2CharacterTemplate]
strCharacterName="Skirmisher Warrior"
strCharacterBackgroundMale[0]="<XGParam:StrValue1/!FirstName/> knows little of his birth and retains only hazy, broken memories of his time spent in service to ADVENT. Now free and guided by his fellow Skirmishers, he has found purpose in their drive to overthrow the Elders."
strCharacterBackgroundMale[1]="Among the most recent Skirmishers freed from ADVENT's control, <XGParam:StrValue1/!FirstName/> still suffers from the pains associated with the removal of his chip.  The ritual scarification his people immediately applied to the extraction site only exacerbates the issue."
strCharacterBackgroundMale[2]="Originally stationed at a remote ADVENT outpost, <XGParam:StrValue1/!FirstName/> was left for dead by his masters after being wounded in the field. When he awoke his control chip had malfunctioned, leaving him free of the Elders' commands but alone and gravely wounded."
strCharacterBackgroundMale[3]="Freed from the Elders' grasp by Betos herself, <XGParam:StrValue1/!FirstName/> is among the most loyal and fearsome of the Skirmisher warriors. He is driven to ensure that the Elders learn his name, the name they never intended him to have."
strCharacterBackgroundMale[4]="Much like Mox himself, <XGParam:StrValue1/!FirstName/> is known to the human factions for crimes he committed in the Elders name while still under their control. Although most would not hold them accountable, just as with Mox, <XGParam:StrValue1/!FirstName/> is intent on atoning for these mistakes regardless."
strCharacterBackgroundFemale[0]="<XGParam:StrValue1/!FirstName/> knows little of her birth and retains only hazy, broken memories of her time spent in service to ADVENT. Now free and guided by her fellow Skirmishers, she has found purpose in their drive to overthrow the Elders."
strCharacterBackgroundFemale[1]="Among the most recent Skirmishers freed from ADVENT's control, <XGParam:StrValue1/!FirstName/> still suffers from the pains associated with the removal of her chip.  The ritual scarification her people immediately applied to the extraction site only exacerbates the issue."
strCharacterBackgroundFemale[2]="Originally stationed at a remote ADVENT outpost, <XGParam:StrValue1/!FirstName/> was left for dead by her masters after being wounded in the field. When she awoke her control chip had malfunctioned, leaving her free of the Elders' commands but alone and gravely wounded."
strCharacterBackgroundFemale[3]="Freed from the Elders' grasp by Betos herself, <XGParam:StrValue1/!FirstName/> is among the most loyal and fearsome of the Skirmisher warriors. She is driven to ensure that the Elders learn her name, the name they never intended her to have." 
strCharacterBackgroundFemale[4]="Much like Mox himself, <XGParam:StrValue1/!FirstName/> is known to the human factions for crimes she committed in the Elders name while still under their control. Although most would not hold them accountable, just as with Mox, <XGParam:StrValue1/!FirstName/> is intent on atoning for these mistakes regardless." 

[SkirmisherWarrior_M2 X2CharacterTemplate]
strCharacterName="Skirmisher Fighter"
strCharacterBackgroundMale[0]="<XGParam:StrValue1/!FirstName/> knows little of his birth and retains only hazy, broken memories of his time spent in service to ADVENT. Now free and guided by his fellow Skirmishers, he has found purpose in their drive to overthrow the Elders."
strCharacterBackgroundMale[1]="Among the most recent Skirmishers freed from ADVENT's control, <XGParam:StrValue1/!FirstName/> still suffers from the pains associated with the removal of his chip.  The ritual scarification his people immediately applied to the extraction site only exacerbates the issue."
strCharacterBackgroundMale[2]="Originally stationed at a remote ADVENT outpost, <XGParam:StrValue1/!FirstName/> was left for dead by his masters after being wounded in the field. When he awoke his control chip had malfunctioned, leaving him free of the Elders' commands but alone and gravely wounded."
strCharacterBackgroundMale[3]="Freed from the Elders' grasp by Betos herself, <XGParam:StrValue1/!FirstName/> is among the most loyal and fearsome of the Skirmisher warriors. He is driven to ensure that the Elders learn his name, the name they never intended him to have."
strCharacterBackgroundMale[4]="Much like Mox himself, <XGParam:StrValue1/!FirstName/> is known to the human factions for crimes he committed in the Elders name while still under their control. Although most would not hold them accountable, just as with Mox, <XGParam:StrValue1/!FirstName/> is intent on atoning for these mistakes regardless."
strCharacterBackgroundFemale[0]="<XGParam:StrValue1/!FirstName/> knows little of her birth and retains only hazy, broken memories of her time spent in service to ADVENT. Now free and guided by her fellow Skirmishers, she has found purpose in their drive to overthrow the Elders."
strCharacterBackgroundFemale[1]="Among the most recent Skirmishers freed from ADVENT's control, <XGParam:StrValue1/!FirstName/> still suffers from the pains associated with the removal of her chip.  The ritual scarification her people immediately applied to the extraction site only exacerbates the issue."
strCharacterBackgroundFemale[2]="Originally stationed at a remote ADVENT outpost, <XGParam:StrValue1/!FirstName/> was left for dead by her masters after being wounded in the field. When she awoke her control chip had malfunctioned, leaving her free of the Elders' commands but alone and gravely wounded."
strCharacterBackgroundFemale[3]="Freed from the Elders' grasp by Betos herself, <XGParam:StrValue1/!FirstName/> is among the most loyal and fearsome of the Skirmisher warriors. She is driven to ensure that the Elders learn her name, the name they never intended her to have." 
strCharacterBackgroundFemale[4]="Much like Mox himself, <XGParam:StrValue1/!FirstName/> is known to the human factions for crimes she committed in the Elders name while still under their control. Although most would not hold them accountable, just as with Mox, <XGParam:StrValue1/!FirstName/> is intent on atoning for these mistakes regardless." 

[SkirmisherWarrior_M3 X2CharacterTemplate]
strCharacterName="Skirmisher Hero"
strCharacterBackgroundMale[0]="<XGParam:StrValue1/!FirstName/> knows little of his birth and retains only hazy, broken memories of his time spent in service to ADVENT. Now free and guided by his fellow Skirmishers, he has found purpose in their drive to overthrow the Elders."
strCharacterBackgroundMale[1]="Among the most recent Skirmishers freed from ADVENT's control, <XGParam:StrValue1/!FirstName/> still suffers from the pains associated with the removal of his chip.  The ritual scarification his people immediately applied to the extraction site only exacerbates the issue."
strCharacterBackgroundMale[2]="Originally stationed at a remote ADVENT outpost, <XGParam:StrValue1/!FirstName/> was left for dead by his masters after being wounded in the field. When he awoke his control chip had malfunctioned, leaving him free of the Elders' commands but alone and gravely wounded."
strCharacterBackgroundMale[3]="Freed from the Elders' grasp by Betos herself, <XGParam:StrValue1/!FirstName/> is among the most loyal and fearsome of the Skirmisher warriors. He is driven to ensure that the Elders learn his name, the name they never intended him to have."
strCharacterBackgroundMale[4]="Much like Mox himself, <XGParam:StrValue1/!FirstName/> is known to the human factions for crimes he committed in the Elders name while still under their control. Although most would not hold them accountable, just as with Mox, <XGParam:StrValue1/!FirstName/> is intent on atoning for these mistakes regardless."
strCharacterBackgroundFemale[0]="<XGParam:StrValue1/!FirstName/> knows little of her birth and retains only hazy, broken memories of her time spent in service to ADVENT. Now free and guided by her fellow Skirmishers, she has found purpose in their drive to overthrow the Elders."
strCharacterBackgroundFemale[1]="Among the most recent Skirmishers freed from ADVENT's control, <XGParam:StrValue1/!FirstName/> still suffers from the pains associated with the removal of her chip.  The ritual scarification her people immediately applied to the extraction site only exacerbates the issue."
strCharacterBackgroundFemale[2]="Originally stationed at a remote ADVENT outpost, <XGParam:StrValue1/!FirstName/> was left for dead by her masters after being wounded in the field. When she awoke her control chip had malfunctioned, leaving her free of the Elders' commands but alone and gravely wounded."
strCharacterBackgroundFemale[3]="Freed from the Elders' grasp by Betos herself, <XGParam:StrValue1/!FirstName/> is among the most loyal and fearsome of the Skirmisher warriors. She is driven to ensure that the Elders learn her name, the name they never intended her to have." 
strCharacterBackgroundFemale[4]="Much like Mox himself, <XGParam:StrValue1/!FirstName/> is known to the human factions for crimes she committed in the Elders name while still under their control. Although most would not hold them accountable, just as with Mox, <XGParam:StrValue1/!FirstName/> is intent on atoning for these mistakes regardless." 


[TemplarDisciple X2CharacterTemplate]
strCharacterName="Templar Disciple"
strCharacterBackgroundMale[0]="<XGParam:StrValue1/!FirstName/> admittedly never felt the calling or any sort of Psionic gift before encountering members of the Templar faction operating in <XGParam:StrValue0/!CountryName/>. Once he donned a set of their amplifying gauntlets, that all changed."
strCharacterBackgroundMale[1]="Geist believes <XGParam:StrValue1/!FirstName/> is one of the more naturally gifted among his many followers. Long before encountering the Templars, <XGParam:StrValue1/!FirstName/> was already manipulating his surroundings with the power of Psionic energy."
strCharacterBackgroundMale[2]="Once a nonbeliever, <XGParam:StrValue1/!FirstName/> was swayed by the Templars' power after being protected by their forces during an ADVENT sweep of his settlement. Soon after the attack, he pledged his service to Geist and began the required training."
strCharacterBackgroundMale[3]="Among the Templars, <XGParam:StrValue1/!FirstName/> is recognized for having spent days at a time meditating in a Psionic trance without interruption. It is said that during one such trance he had a vision of something greater yet to come, but none will speak of it."
strCharacterBackgroundMale[4]="<XGParam:StrValue1/!FirstName/> was a frequent contributor to the Templar's development efforts involving their Psionic amplifying gauntlets. Rumor has it he may have conducted tests on himself that left him unstable."
strCharacterBackgroundFemale[0]="<XGParam:StrValue1/!FirstName/> admittedly never felt the calling or any sort of Psionic gift before encountering members of the Templar faction operating in <XGParam:StrValue0/!CountryName/>. Once she donned a set of their amplifying gauntlets, that all changed."
strCharacterBackgroundFemale[1]="Geist believes <XGParam:StrValue1/!FirstName/> is one of the more naturally gifted among her many followers. Long before encountering the Templars, <XGParam:StrValue1/!FirstName/> was already manipulating her surroundings with the power of Psionic energy."
strCharacterBackgroundFemale[2]="Once a nonbeliever, <XGParam:StrValue1/!FirstName/> was swayed by the Templars' power after being protected by their forces during an ADVENT sweep of his settlement. Soon after the attack, she pledged her service to Geist and began the required training."
strCharacterBackgroundFemale[3]="Among the Templars, <XGParam:StrValue1/!FirstName/> is recognized for having spent days at a time meditating in a Psionic trance without interruption. It is said that during one such trance she had a vision of something greater yet to come, but none will speak of it." 
strCharacterBackgroundFemale[4]="<XGParam:StrValue1/!FirstName/> was a frequent contributor to the Templar's development efforts involving their Psionic amplifying gauntlets. Rumor has it she may have conducted tests on herself that left her unstable." 

[TemplarDisciple_M2 X2CharacterTemplate]
strCharacterName="Templar Adept"
strCharacterBackgroundMale[0]="<XGParam:StrValue1/!FirstName/> admittedly never felt the calling or any sort of Psionic gift before encountering members of the Templar faction operating in <XGParam:StrValue0/!CountryName/>. Once he donned a set of their amplifying gauntlets, that all changed."
strCharacterBackgroundMale[1]="Geist believes <XGParam:StrValue1/!FirstName/> is one of the more naturally gifted among his many followers. Long before encountering the Templars, <XGParam:StrValue1/!FirstName/> was already manipulating his surroundings with the power of Psionic energy."
strCharacterBackgroundMale[2]="Once a nonbeliever, <XGParam:StrValue1/!FirstName/> was swayed by the Templars' power after being protected by their forces during an ADVENT sweep of his settlement. Soon after the attack, he pledged his service to Geist and began the required training."
strCharacterBackgroundMale[3]="Among the Templars, <XGParam:StrValue1/!FirstName/> is recognized for having spent days at a time meditating in a Psionic trance without interruption. It is said that during one such trance he had a vision of something greater yet to come, but none will speak of it."
strCharacterBackgroundMale[4]="<XGParam:StrValue1/!FirstName/> was a frequent contributor to the Templar's development efforts involving their Psionic amplifying gauntlets. Rumor has it he may have conducted tests on himself that left him unstable."
strCharacterBackgroundFemale[0]="<XGParam:StrValue1/!FirstName/> admittedly never felt the calling or any sort of Psionic gift before encountering members of the Templar faction operating in <XGParam:StrValue0/!CountryName/>. Once she donned a set of their amplifying gauntlets, that all changed."
strCharacterBackgroundFemale[1]="Geist believes <XGParam:StrValue1/!FirstName/> is one of the more naturally gifted among her many followers. Long before encountering the Templars, <XGParam:StrValue1/!FirstName/> was already manipulating her surroundings with the power of Psionic energy."
strCharacterBackgroundFemale[2]="Once a nonbeliever, <XGParam:StrValue1/!FirstName/> was swayed by the Templars' power after being protected by their forces during an ADVENT sweep of his settlement. Soon after the attack, she pledged her service to Geist and began the required training."
strCharacterBackgroundFemale[3]="Among the Templars, <XGParam:StrValue1/!FirstName/> is recognized for having spent days at a time meditating in a Psionic trance without interruption. It is said that during one such trance she had a vision of something greater yet to come, but none will speak of it." 
strCharacterBackgroundFemale[4]="<XGParam:StrValue1/!FirstName/> was a frequent contributor to the Templar's development efforts involving their Psionic amplifying gauntlets. Rumor has it she may have conducted tests on herself that left her unstable." 

[TemplarDisciple_M3 X2CharacterTemplate]
strCharacterName="Templar Monk"
strCharacterBackgroundMale[0]="<XGParam:StrValue1/!FirstName/> admittedly never felt the calling or any sort of Psionic gift before encountering members of the Templar faction operating in <XGParam:StrValue0/!CountryName/>. Once he donned a set of their amplifying gauntlets, that all changed."
strCharacterBackgroundMale[1]="Geist believes <XGParam:StrValue1/!FirstName/> is one of the more naturally gifted among his many followers. Long before encountering the Templars, <XGParam:StrValue1/!FirstName/> was already manipulating his surroundings with the power of Psionic energy."
strCharacterBackgroundMale[2]="Once a nonbeliever, <XGParam:StrValue1/!FirstName/> was swayed by the Templars' power after being protected by their forces during an ADVENT sweep of his settlement. Soon after the attack, he pledged his service to Geist and began the required training."
strCharacterBackgroundMale[3]="Among the Templars, <XGParam:StrValue1/!FirstName/> is recognized for having spent days at a time meditating in a Psionic trance without interruption. It is said that during one such trance he had a vision of something greater yet to come, but none will speak of it."
strCharacterBackgroundMale[4]="<XGParam:StrValue1/!FirstName/> was a frequent contributor to the Templar's development efforts involving their Psionic amplifying gauntlets. Rumor has it he may have conducted tests on himself that left him unstable."
strCharacterBackgroundFemale[0]="<XGParam:StrValue1/!FirstName/> admittedly never felt the calling or any sort of Psionic gift before encountering members of the Templar faction operating in <XGParam:StrValue0/!CountryName/>. Once she donned a set of their amplifying gauntlets, that all changed."
strCharacterBackgroundFemale[1]="Geist believes <XGParam:StrValue1/!FirstName/> is one of the more naturally gifted among her many followers. Long before encountering the Templars, <XGParam:StrValue1/!FirstName/> was already manipulating her surroundings with the power of Psionic energy."
strCharacterBackgroundFemale[2]="Once a nonbeliever, <XGParam:StrValue1/!FirstName/> was swayed by the Templars' power after being protected by their forces during an ADVENT sweep of his settlement. Soon after the attack, she pledged her service to Geist and began the required training."
strCharacterBackgroundFemale[3]="Among the Templars, <XGParam:StrValue1/!FirstName/> is recognized for having spent days at a time meditating in a Psionic trance without interruption. It is said that during one such trance she had a vision of something greater yet to come, but none will speak of it." 
strCharacterBackgroundFemale[4]="<XGParam:StrValue1/!FirstName/> was a frequent contributor to the Templar's development efforts involving their Psionic amplifying gauntlets. Rumor has it she may have conducted tests on herself that left her unstable." 

[ResistanceOperative X2CharacterTemplate]
strCharacterName="Resistance Operative"

[ResistanceOperative_M2 X2CharacterTemplate]
strCharacterName="Resistance Agent"

[ResistanceOperative_M3 X2CharacterTemplate]
strCharacterName="Resistance Spy"


;
; WEAPONS
;
[VektorFactionRifle_CV X2WeaponTemplate]
FriendlyName="Vektor Rifle"
FriendlyNamePlural="Vektor Rifles"
BriefSummary="Reliant on a specialized cartridge presumably handloaded by the Reapers, the Vektor Rifle is a purpose-built sniper rifle designed for long range engagement and squad support. A relatively light weapon with excellent corrosion Resistance, it is ideal for the harsh environments typically associated with the Reaper faction."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn, in the absence of special training.\n<Bullet/> The Vektor Rifle is effective at all ranges.\n<Bullet/> Use upgrades looted from enemies to improve the Vektor Rifle's tactical effectiveness."
AbilityDescName="vektor rifle"

[VektorFactionRifle_MG X2WeaponTemplate]
FriendlyName="Temnotic Rifle"
FriendlyNamePlural="Temnotic Rifles"
BriefSummary="Modifying the existing Vektor rifle frame to allow for the integration of a magnetic accelerator, the weapon is now capable of firing ferromagnetic projectiles that can be mass produced by our engineering staff with relative ease. Damage output has been significantly improved as a result."
TacticalText="<Bullet/> Magnetized weapon technology makes for a lethal upgrade to the Reaper's Vektor Rifle.\n<Bullet/> Firing the primary weapon always ends the soldier's turn, in the absence of special training.\n<Bullet/> The Temnotic Rifle is effective at all ranges.\n<Bullet/> Use upgrades looted from enemies to improve the Temnotic Rifle's tactical effectiveness."
AbilityDescName="vektor rifle"

[FactionBullpup_CV X2WeaponTemplate]
FriendlyName="Kal-7 Bullpup"
FriendlyNamePlural="Kal-7 Bullpups"
BriefSummary="The Skirmishers make for dangerous melee combatants, but they still rely on a unique Bullpup rifle design adapted from the weapons they were originally assigned during their service to ADVENT. At close range, these shotguns provide excellent stopping power, while the stock improves recovery time during extended firing."
TacticalText="<Bullet/> Firing the Bullpup does not end the Skirmisher's turn, and it can be fired twice in a single turn.\n<Bullet/> Bullpups are extremely effective at close range, but their accuracy drops off quickly at longer range.\n<Bullet/> Use upgrades looted from enemies to improve the Bullpup's tactical effectiveness."
AbilityDescName="bullpup"

[FactionBullpup_MG X2WeaponTemplate]
FriendlyName="Kal-15 Bullpup"
FriendlyNamePlural="Kal-15 Bullpups"
BriefSummary="The introduction of a magnetic accelerator to the original Skirmisher Bullpup rifle provides an even more lethal punch to an already dangerous close-quarters weapon. Although ADVENT may have originally supplied these soldiers with ammunition based on the alien alloys, they've had to make due with more conventional materials in the time since they were freed."
TacticalText="<Bullet/> Magnetized weapon technology makes for an especially effective improvement of the Skirmisher Bullpup.\n<Bullet/> Firing a Bullpup does not end the Skirmisher's turn, and it can be fired twice in a single turn.\n<Bullet/> Bullpup-style weapons are extremely effective at close range, but their accuracy drops off quickly at longer range.\n<Bullet/> Use upgrades looted from enemies to improve the Kal-15 Bullpup's tactical effectiveness."
AbilityDescName="bullpup"

[FactionShardGauntlet_CV X2PairedWeaponTemplate]
FriendlyName="Shard Gauntlets"
FriendlyNamePlural="Shard Gauntlets"
BriefSummary="The Templars developed these unique gauntlets to boost the Psionic potential of any user regardless of their natural talents. By tapping directly into the body, the gauntlets capture the users' latent power and amplify it to the point that it can be focused and released on command, unleashing a deadly blade of pure Psionic energy."
TacticalText="<Bullet/> Templars can attack adjacent enemies with their shard even after using both actions to move or dash to the extent of their movement range.\n<Bullet/> The decision to engage the enemy in melee combat can be a decisive one; exercise caution.\n<Bullet/> Keep an eye out for opportunities to improve our edged weapon effectiveness - the enemy may have access to much better technology."
AbilityDescName="shard"

[FactionShardGauntlet_MG X2PairedWeaponTemplate]
FriendlyName="Tempest Gauntlets"
FriendlyNamePlural="Tempest Gauntlets"
BriefSummary="The paired Templar gauntlets were designed to amplify the user's Psionic energy, but at their core, they are still gauntlets--stout, metallic gloves capable of withstanding extremes well beyond what flesh alone can take. With magnetic plating layered over the existing structure, they now provide much more than the original enhancement they were created for."
TacticalText="<Bullet/> Templars can attack adjacent enemies with their shard even after using both actions to move or dash to the extent of their movement range.\n<Bullet/> The decision to engage the enemy in melee combat can be a decisive one; exercise caution.\n<Bullet/> Keep an eye out for opportunities to improve our edged weapon effectiveness - the enemy may have access to much better technology."
AbilityDescName="shard"


[OperativePistol_CV X2WeaponTemplate]
FriendlyName="Pistol"
FriendlyNamePlural="Pistols"
BriefSummary="XCOM Sharpshooters carry high-caliber pistols in addition to their sniper rifles. With the proper training, Sharpshooters can pose an enormous threat at close range."
TacticalText="<Bullet/> Pistols can be much more than a sidearm in the hands of a trained Sharpshooter.\n<Bullet/> Unlike the sniper rifle, pistols can be fired with a single action.\n<Bullet/> Sharpshooters can train several abilities that dramatically enhance their use of pistols."
AbilityDescName="pistol"

[OperativePistol_MG X2WeaponTemplate]
FriendlyName="Mag Pistol"
FriendlyNamePlural="Mag Pistols"
BriefSummary="Based on the advances in magnetic weapons tech we've achieved, this new pistol boasts a substantial improvement in power over our conventional pistol."
TacticalText="<Bullet/> Magnetic pistols are substantially more effective than their conventional precursors.\n<Bullet/> Unlike the sniper rifle, pistols can be fired with a single action."
AbilityDescName="pistol"

[OperativePistol_BM X2WeaponTemplate]
FriendlyName="Beam Pistol"
FriendlyNamePlural="Beam Pistols"
BriefSummary="The ultimate sidearm, this pistol integrates the aliens' beam weapons technology to powerful effect."
TacticalText="<Bullet/> Beam pistols are the most powerful handguns on Earth.\n<Bullet/> Unlike the sniper rifle, pistols can be fired with a single action."
AbilityDescName="pistol"

;
;ABILITIES
;

[RM_Disabler X2AbilityTemplate]
LocFriendlyName="Weapon Disabler"
LocHelpText="Causes ADVENT and alien weaponry to jam, forcing them to reload their weapons."
LocLongDescription="Causes ADVENT and alien weaponry to jam, forcing them to reload their weapons."
LocFlyOverText="Weapon Disabler"

[RM_NetworkStun X2AbilityTemplate]
LocFriendlyName="Network Stun"
LocHelpText="Stun all enemy units for 2 turns, if the operative hacks the objective."
LocLongDescription="Stun all enemy units for 2 turns, if the operative hacks the objective."
